src/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:mes="http://proteo.bs.com/soa/service/mainframe/Validacioncv/domain/message"
                  xmlns:head="http://xmlns.bancsabadell.com/proteo/SharedResources/Header"
                  xmlns:dom="http://proteo.bs.com/soa/service/mainframe/Validacioncv/domain">
    <soapenv:Header/>
    <soapenv:Body>
        <mes:validacioncvRequest>
            <head:HeaderRequest>
                <!--Optional:-->
                <head:trackingId>trackingId123</head:trackingId>
                <!--Optional:-->
                <head:step>?</head:step>
                <!--Optional:-->
                <head:applicationId>?</head:applicationId>
                <!--Optional:-->
                <head:language>language123</head:language>
                <!--Optional:-->
                <head:HostRequest>
                    <head:sessionId>sessionId123</head:sessionId>
                    <!--Optional:-->
                    <head:authorizationId>authorizationId123</head:authorizationId>
                </head:HostRequest>
            </head:HeaderRequest>
            <dom:InputData>
                <dom:isin>?</dom:isin>
                <dom:codigoEmision>?</dom:codigoEmision>
                <dom:alternateID>?</dom:alternateID>
                <dom:cantidadNominalEfectivo>?</dom:cantidadNominalEfectivo>
                <dom:divisa>?</dom:divisa>
                <dom:identificacionFiscal>?</dom:identificacionFiscal>
                <dom:cuentaValores>?</dom:cuentaValores>
                <dom:tipoOrden>?</dom:tipoOrden>
                <dom:precioLimite>?</dom:precioLimite>
                <dom:cuentaCorriente>?</dom:cuentaCorriente>
                <dom:fechaValor>?</dom:fechaValor>
                <dom:indicadorMercadoPrimario>?</dom:indicadorMercadoPrimario>
                <dom:fechaVencimiento>?</dom:fechaVencimiento>
                <dom:programaMarco>?</dom:programaMarco>
                <dom:clearer>?</dom:clearer>
                <dom:indLiCCO>?</dom:indLiCCO>
                <dom:tipoDeEven>?</dom:tipoDeEven>
                <dom:globalId>?</dom:globalId>
            </dom:InputData>
        </mes:validacioncvRequest>
    </soapenv:Body>
</soapenv:Envelope>